SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_hfxo.h
/* Bit fields for HFXO BUFOUTCTRL */
#define _HFXO_BUFOUTCTRL_RESETVALUE             0x00643C15UL                            /**< Default value for HFXO_BUFOUTCTRL           */
#define _HFXO_BUFOUTCTRL_MASK                   0xC0FFFFFFUL                            /**< Mask for HFXO_BUFOUTCTRL                    */
#define _HFXO_BUFOUTCTRL_XOUTBIASANA_SHIFT      0                                       /**< Shift value for HFXO_XOUTBIASANA            */
#define _HFXO_BUFOUTCTRL_XOUTBIASANA_MASK       0xFUL                                   /**< Bit mask for HFXO_XOUTBIASANA               */
#define _HFXO_BUFOUTCTRL_XOUTBIASANA_DEFAULT    0x00000005UL                            /**< Mode DEFAULT for HFXO_BUFOUTCTRL            */
#define HFXO_BUFOUTCTRL_XOUTBIASANA_DEFAULT     (_HFXO_BUFOUTCTRL_XOUTBIASANA_DEFAULT << 0) /**< Shifted mode DEFAULT for HFXO_BUFOUTCTRL    */
#define _HFXO_BUFOUTCTRL_XOUTCFANA_SHIFT        4                                       /**< Shift value for HFXO_XOUTCFANA              */
#define _HFXO_BUFOUTCTRL_XOUTCFANA_MASK         0xF0UL                                  /**< Bit mask for HFXO_XOUTCFANA                 */
#define _HFXO_BUFOUTCTRL_XOUTCFANA_DEFAULT      0x00000001UL                            /**< Mode DEFAULT for HFXO_BUFOUTCTRL            */
#define HFXO_BUFOUTCTRL_XOUTCFANA_DEFAULT       (_HFXO_BUFOUTCTRL_XOUTCFANA_DEFAULT << 4) /**< Shifted mode DEFAULT for HFXO_BUFOUTCTRL    */
#define _HFXO_BUFOUTCTRL_XOUTGMANA_SHIFT        8                                       /**< Shift value for HFXO_XOUTGMANA              */
#define _HFXO_BUFOUTCTRL_XOUTGMANA_MASK         0xF00UL                                 /**< Bit mask for HFXO_XOUTGMANA                 */
#define _HFXO_BUFOUTCTRL_XOUTGMANA_DEFAULT      0x0000000CUL                            /**< Mode DEFAULT for HFXO_BUFOUTCTRL            */
#define HFXO_BUFOUTCTRL_XOUTGMANA_DEFAULT       (_HFXO_BUFOUTCTRL_XOUTGMANA_DEFAULT << 8) /**< Shifted mode DEFAULT for HFXO_BUFOUTCTRL    */
#define _HFXO_BUFOUTCTRL_PEAKDETTHRESANA_SHIFT  12                                      /**< Shift value for HFXO_PEAKDETTHRESANA        */
#define _HFXO_BUFOUTCTRL_PEAKDETTHRESANA_MASK   0xF000UL                                /**< Bit mask for HFXO_PEAKDETTHRESANA           */
#define _HFXO_BUFOUTCTRL_PEAKDETTHRESANA_DEFAULT 0x00000003UL                            /**< Mode DEFAULT for HFXO_BUFOUTCTRL            */
#define _HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V105MV 0x00000000UL                            /**< Mode V105MV for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V132MV 0x00000001UL                            /**< Mode V132MV for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V157MV 0x00000002UL                            /**< Mode V157MV for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V184MV 0x00000003UL                            /**< Mode V184MV for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V210MV 0x00000004UL                            /**< Mode V210MV for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V236MV 0x00000005UL                            /**< Mode V236MV for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V262MV 0x00000006UL                            /**< Mode V262MV for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V289MV 0x00000007UL                            /**< Mode V289MV for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V315MV 0x00000008UL                            /**< Mode V315MV for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V341MV 0x00000009UL                            /**< Mode V341MV for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V367MV 0x0000000AUL                            /**< Mode V367MV for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V394MV 0x0000000BUL                            /**< Mode V394MV for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V420MV 0x0000000CUL                            /**< Mode V420MV for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V446MV 0x0000000DUL                            /**< Mode V446MV for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V472MV 0x0000000EUL                            /**< Mode V472MV for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V499MV 0x0000000FUL                            /**< Mode V499MV for HFXO_BUFOUTCTRL             */
#define HFXO_BUFOUTCTRL_PEAKDETTHRESANA_DEFAULT (_HFXO_BUFOUTCTRL_PEAKDETTHRESANA_DEFAULT << 12) /**< Shifted mode DEFAULT for HFXO_BUFOUTCTRL    */
#define HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V105MV  (_HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V105MV << 12) /**< Shifted mode V105MV for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V132MV  (_HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V132MV << 12) /**< Shifted mode V132MV for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V157MV  (_HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V157MV << 12) /**< Shifted mode V157MV for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V184MV  (_HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V184MV << 12) /**< Shifted mode V184MV for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V210MV  (_HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V210MV << 12) /**< Shifted mode V210MV for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V236MV  (_HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V236MV << 12) /**< Shifted mode V236MV for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V262MV  (_HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V262MV << 12) /**< Shifted mode V262MV for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V289MV  (_HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V289MV << 12) /**< Shifted mode V289MV for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V315MV  (_HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V315MV << 12) /**< Shifted mode V315MV for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V341MV  (_HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V341MV << 12) /**< Shifted mode V341MV for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V367MV  (_HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V367MV << 12) /**< Shifted mode V367MV for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V394MV  (_HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V394MV << 12) /**< Shifted mode V394MV for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V420MV  (_HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V420MV << 12) /**< Shifted mode V420MV for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V446MV  (_HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V446MV << 12) /**< Shifted mode V446MV for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V472MV  (_HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V472MV << 12) /**< Shifted mode V472MV for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V499MV  (_HFXO_BUFOUTCTRL_PEAKDETTHRESANA_V499MV << 12) /**< Shifted mode V499MV for HFXO_BUFOUTCTRL     */
#define _HFXO_BUFOUTCTRL_TIMEOUTCTUNE_SHIFT     16                                      /**< Shift value for HFXO_TIMEOUTCTUNE           */
#define _HFXO_BUFOUTCTRL_TIMEOUTCTUNE_MASK      0xF0000UL                               /**< Bit mask for HFXO_TIMEOUTCTUNE              */
#define _HFXO_BUFOUTCTRL_TIMEOUTCTUNE_DEFAULT   0x00000004UL                            /**< Mode DEFAULT for HFXO_BUFOUTCTRL            */
#define _HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T2US      0x00000000UL                            /**< Mode T2US for HFXO_BUFOUTCTRL               */
#define _HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T5US      0x00000001UL                            /**< Mode T5US for HFXO_BUFOUTCTRL               */
#define _HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T10US     0x00000002UL                            /**< Mode T10US for HFXO_BUFOUTCTRL              */
#define _HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T16US     0x00000003UL                            /**< Mode T16US for HFXO_BUFOUTCTRL              */
#define _HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T21US     0x00000004UL                            /**< Mode T21US for HFXO_BUFOUTCTRL              */
#define _HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T26US     0x00000005UL                            /**< Mode T26US for HFXO_BUFOUTCTRL              */
#define _HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T31US     0x00000006UL                            /**< Mode T31US for HFXO_BUFOUTCTRL              */
#define _HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T42US     0x00000007UL                            /**< Mode T42US for HFXO_BUFOUTCTRL              */
#define _HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T52US     0x00000008UL                            /**< Mode T52US for HFXO_BUFOUTCTRL              */
#define _HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T63US     0x00000009UL                            /**< Mode T63US for HFXO_BUFOUTCTRL              */
#define _HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T83US     0x0000000AUL                            /**< Mode T83US for HFXO_BUFOUTCTRL              */
#define _HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T104US    0x0000000BUL                            /**< Mode T104US for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T208US    0x0000000CUL                            /**< Mode T208US for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T313US    0x0000000DUL                            /**< Mode T313US for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T521US    0x0000000EUL                            /**< Mode T521US for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T938US    0x0000000FUL                            /**< Mode T938US for HFXO_BUFOUTCTRL             */
#define HFXO_BUFOUTCTRL_TIMEOUTCTUNE_DEFAULT    (_HFXO_BUFOUTCTRL_TIMEOUTCTUNE_DEFAULT << 16) /**< Shifted mode DEFAULT for HFXO_BUFOUTCTRL    */
#define HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T2US       (_HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T2US << 16) /**< Shifted mode T2US for HFXO_BUFOUTCTRL       */
#define HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T5US       (_HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T5US << 16) /**< Shifted mode T5US for HFXO_BUFOUTCTRL       */
#define HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T10US      (_HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T10US << 16) /**< Shifted mode T10US for HFXO_BUFOUTCTRL      */
#define HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T16US      (_HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T16US << 16) /**< Shifted mode T16US for HFXO_BUFOUTCTRL      */
#define HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T21US      (_HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T21US << 16) /**< Shifted mode T21US for HFXO_BUFOUTCTRL      */
#define HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T26US      (_HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T26US << 16) /**< Shifted mode T26US for HFXO_BUFOUTCTRL      */
#define HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T31US      (_HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T31US << 16) /**< Shifted mode T31US for HFXO_BUFOUTCTRL      */
#define HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T42US      (_HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T42US << 16) /**< Shifted mode T42US for HFXO_BUFOUTCTRL      */
#define HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T52US      (_HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T52US << 16) /**< Shifted mode T52US for HFXO_BUFOUTCTRL      */
#define HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T63US      (_HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T63US << 16) /**< Shifted mode T63US for HFXO_BUFOUTCTRL      */
#define HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T83US      (_HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T83US << 16) /**< Shifted mode T83US for HFXO_BUFOUTCTRL      */
#define HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T104US     (_HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T104US << 16) /**< Shifted mode T104US for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T208US     (_HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T208US << 16) /**< Shifted mode T208US for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T313US     (_HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T313US << 16) /**< Shifted mode T313US for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T521US     (_HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T521US << 16) /**< Shifted mode T521US for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T938US     (_HFXO_BUFOUTCTRL_TIMEOUTCTUNE_T938US << 16) /**< Shifted mode T938US for HFXO_BUFOUTCTRL     */
#define _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_SHIFT   20                                      /**< Shift value for HFXO_TIMEOUTSTARTUP         */
#define _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_MASK    0xF00000UL                              /**< Bit mask for HFXO_TIMEOUTSTARTUP            */
#define _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_DEFAULT 0x00000006UL                            /**< Mode DEFAULT for HFXO_BUFOUTCTRL            */
#define _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T42US   0x00000000UL                            /**< Mode T42US for HFXO_BUFOUTCTRL              */
#define _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T83US   0x00000001UL                            /**< Mode T83US for HFXO_BUFOUTCTRL              */
#define _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T108US  0x00000002UL                            /**< Mode T108US for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T133US  0x00000003UL                            /**< Mode T133US for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T158US  0x00000004UL                            /**< Mode T158US for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T183US  0x00000005UL                            /**< Mode T183US for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T208US  0x00000006UL                            /**< Mode T208US for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T233US  0x00000007UL                            /**< Mode T233US for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T258US  0x00000008UL                            /**< Mode T258US for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T283US  0x00000009UL                            /**< Mode T283US for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T333US  0x0000000AUL                            /**< Mode T333US for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T375US  0x0000000BUL                            /**< Mode T375US for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T417US  0x0000000CUL                            /**< Mode T417US for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T458US  0x0000000DUL                            /**< Mode T458US for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T500US  0x0000000EUL                            /**< Mode T500US for HFXO_BUFOUTCTRL             */
#define _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T667US  0x0000000FUL                            /**< Mode T667US for HFXO_BUFOUTCTRL             */
#define HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_DEFAULT  (_HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_DEFAULT << 20) /**< Shifted mode DEFAULT for HFXO_BUFOUTCTRL    */
#define HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T42US    (_HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T42US << 20) /**< Shifted mode T42US for HFXO_BUFOUTCTRL      */
#define HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T83US    (_HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T83US << 20) /**< Shifted mode T83US for HFXO_BUFOUTCTRL      */
#define HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T108US   (_HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T108US << 20) /**< Shifted mode T108US for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T133US   (_HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T133US << 20) /**< Shifted mode T133US for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T158US   (_HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T158US << 20) /**< Shifted mode T158US for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T183US   (_HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T183US << 20) /**< Shifted mode T183US for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T208US   (_HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T208US << 20) /**< Shifted mode T208US for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T233US   (_HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T233US << 20) /**< Shifted mode T233US for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T258US   (_HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T258US << 20) /**< Shifted mode T258US for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T283US   (_HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T283US << 20) /**< Shifted mode T283US for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T333US   (_HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T333US << 20) /**< Shifted mode T333US for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T375US   (_HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T375US << 20) /**< Shifted mode T375US for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T417US   (_HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T417US << 20) /**< Shifted mode T417US for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T458US   (_HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T458US << 20) /**< Shifted mode T458US for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T500US   (_HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T500US << 20) /**< Shifted mode T500US for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T667US   (_HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T667US << 20) /**< Shifted mode T667US for HFXO_BUFOUTCTRL     */
#define HFXO_BUFOUTCTRL_MINIMUMSTARTUPDELAY     (0x1UL << 31)                           /**< Minimum Startup Delay                       */
#define _HFXO_BUFOUTCTRL_MINIMUMSTARTUPDELAY_SHIFT 31                                      /**< Shift value for HFXO_MINIMUMSTARTUPDELAY    */
#define _HFXO_BUFOUTCTRL_MINIMUMSTARTUPDELAY_MASK 0x80000000UL                            /**< Bit mask for HFXO_MINIMUMSTARTUPDELAY       */
#define _HFXO_BUFOUTCTRL_MINIMUMSTARTUPDELAY_DEFAULT 0x00000000UL                            /**< Mode DEFAULT for HFXO_BUFOUTCTRL            */
#define HFXO_BUFOUTCTRL_MINIMUMSTARTUPDELAY_DEFAULT (_HFXO_BUFOUTCTRL_MINIMUMSTARTUPDELAY_DEFAULT << 31) /**< Shifted mode DEFAULT for HFXO_BUFOUTCTRL    */

/* Bit fields for HFXO CMD */
#define _HFXO_CMD_RESETVALUE                    0x00000000UL                            /**< Default value for HFXO_CMD                  */
#define _HFXO_CMD_MASK                          0x00000001UL                            /**< Mask for HFXO_CMD                           */
#define HFXO_CMD_COREBIASOPT                    (0x1UL << 0)                            /**< Core Bias Optimizaton                       */
#define _HFXO_CMD_COREBIASOPT_SHIFT             0                                       /**< Shift value for HFXO_COREBIASOPT            */
#define _HFXO_CMD_COREBIASOPT_MASK              0x1UL                                   /**< Bit mask for HFXO_COREBIASOPT               */
#define _HFXO_CMD_COREBIASOPT_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for HFXO_CMD                   */
#define HFXO_CMD_COREBIASOPT_DEFAULT            (_HFXO_CMD_COREBIASOPT_DEFAULT << 0)    /**< Shifted mode DEFAULT for HFXO_CMD           */

