SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_hfxo.h
/* Bit fields for HFXO IEN */
#define _HFXO_IEN_RESETVALUE                    0x00000000UL                            /**< Default value for HFXO_IEN                  */
#define _HFXO_IEN_MASK                          0xF830800FUL                            /**< Mask for HFXO_IEN                           */
#define HFXO_IEN_RDY                            (0x1UL << 0)                            /**< Digital Clock Ready Interrupt               */
#define _HFXO_IEN_RDY_SHIFT                     0                                       /**< Shift value for HFXO_RDY                    */
#define _HFXO_IEN_RDY_MASK                      0x1UL                                   /**< Bit mask for HFXO_RDY                       */
#define _HFXO_IEN_RDY_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for HFXO_IEN                   */
#define HFXO_IEN_RDY_DEFAULT                    (_HFXO_IEN_RDY_DEFAULT << 0)            /**< Shifted mode DEFAULT for HFXO_IEN           */
#define HFXO_IEN_COREBIASOPTRDY                 (0x1UL << 1)                            /**< Core Bias Optimization Ready Interrupt      */
#define _HFXO_IEN_COREBIASOPTRDY_SHIFT          1                                       /**< Shift value for HFXO_COREBIASOPTRDY         */
#define _HFXO_IEN_COREBIASOPTRDY_MASK           0x2UL                                   /**< Bit mask for HFXO_COREBIASOPTRDY            */
#define _HFXO_IEN_COREBIASOPTRDY_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for HFXO_IEN                   */
#define HFXO_IEN_COREBIASOPTRDY_DEFAULT         (_HFXO_IEN_COREBIASOPTRDY_DEFAULT << 1) /**< Shifted mode DEFAULT for HFXO_IEN           */
#define HFXO_IEN_PRSRDY                         (0x1UL << 2)                            /**< PRS Ready Interrupt                         */
#define _HFXO_IEN_PRSRDY_SHIFT                  2                                       /**< Shift value for HFXO_PRSRDY                 */
#define _HFXO_IEN_PRSRDY_MASK                   0x4UL                                   /**< Bit mask for HFXO_PRSRDY                    */
#define _HFXO_IEN_PRSRDY_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for HFXO_IEN                   */
#define HFXO_IEN_PRSRDY_DEFAULT                 (_HFXO_IEN_PRSRDY_DEFAULT << 2)         /**< Shifted mode DEFAULT for HFXO_IEN           */
#define HFXO_IEN_BUFOUTRDY                      (0x1UL << 3)                            /**< BUFOUT Ready Interrupt                      */
#define _HFXO_IEN_BUFOUTRDY_SHIFT               3                                       /**< Shift value for HFXO_BUFOUTRDY              */
#define _HFXO_IEN_BUFOUTRDY_MASK                0x8UL                                   /**< Bit mask for HFXO_BUFOUTRDY                 */
#define _HFXO_IEN_BUFOUTRDY_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for HFXO_IEN                   */
#define HFXO_IEN_BUFOUTRDY_DEFAULT              (_HFXO_IEN_BUFOUTRDY_DEFAULT << 3)      /**< Shifted mode DEFAULT for HFXO_IEN           */
#define HFXO_IEN_BUFOUTFROZEN                   (0x1UL << 15)                           /**< BUFOUT FROZEN Interrupt                     */
#define _HFXO_IEN_BUFOUTFROZEN_SHIFT            15                                      /**< Shift value for HFXO_BUFOUTFROZEN           */
#define _HFXO_IEN_BUFOUTFROZEN_MASK             0x8000UL                                /**< Bit mask for HFXO_BUFOUTFROZEN              */
#define _HFXO_IEN_BUFOUTFROZEN_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for HFXO_IEN                   */
#define HFXO_IEN_BUFOUTFROZEN_DEFAULT           (_HFXO_IEN_BUFOUTFROZEN_DEFAULT << 15)  /**< Shifted mode DEFAULT for HFXO_IEN           */
#define HFXO_IEN_PRSERR                         (0x1UL << 20)                           /**< PRS Requset Error Interrupt                 */
#define _HFXO_IEN_PRSERR_SHIFT                  20                                      /**< Shift value for HFXO_PRSERR                 */
#define _HFXO_IEN_PRSERR_MASK                   0x100000UL                              /**< Bit mask for HFXO_PRSERR                    */
#define _HFXO_IEN_PRSERR_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for HFXO_IEN                   */
#define HFXO_IEN_PRSERR_DEFAULT                 (_HFXO_IEN_PRSERR_DEFAULT << 20)        /**< Shifted mode DEFAULT for HFXO_IEN           */
#define HFXO_IEN_BUFOUTERR                      (0x1UL << 21)                           /**< BUFOUT Request Error Interrupt              */
#define _HFXO_IEN_BUFOUTERR_SHIFT               21                                      /**< Shift value for HFXO_BUFOUTERR              */
#define _HFXO_IEN_BUFOUTERR_MASK                0x200000UL                              /**< Bit mask for HFXO_BUFOUTERR                 */
#define _HFXO_IEN_BUFOUTERR_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for HFXO_IEN                   */
#define HFXO_IEN_BUFOUTERR_DEFAULT              (_HFXO_IEN_BUFOUTERR_DEFAULT << 21)     /**< Shifted mode DEFAULT for HFXO_IEN           */
#define HFXO_IEN_BUFOUTFREEZEERR                (0x1UL << 27)                           /**< BUFOUT Freeze Error Interrupt               */
#define _HFXO_IEN_BUFOUTFREEZEERR_SHIFT         27                                      /**< Shift value for HFXO_BUFOUTFREEZEERR        */
#define _HFXO_IEN_BUFOUTFREEZEERR_MASK          0x8000000UL                             /**< Bit mask for HFXO_BUFOUTFREEZEERR           */
#define _HFXO_IEN_BUFOUTFREEZEERR_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for HFXO_IEN                   */
#define HFXO_IEN_BUFOUTFREEZEERR_DEFAULT        (_HFXO_IEN_BUFOUTFREEZEERR_DEFAULT << 27) /**< Shifted mode DEFAULT for HFXO_IEN           */
#define HFXO_IEN_BUFOUTDNSERR                   (0x1UL << 28)                           /**< BUFOUT Did Not Start Error Interrupt        */
#define _HFXO_IEN_BUFOUTDNSERR_SHIFT            28                                      /**< Shift value for HFXO_BUFOUTDNSERR           */
#define _HFXO_IEN_BUFOUTDNSERR_MASK             0x10000000UL                            /**< Bit mask for HFXO_BUFOUTDNSERR              */
#define _HFXO_IEN_BUFOUTDNSERR_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for HFXO_IEN                   */
#define HFXO_IEN_BUFOUTDNSERR_DEFAULT           (_HFXO_IEN_BUFOUTDNSERR_DEFAULT << 28)  /**< Shifted mode DEFAULT for HFXO_IEN           */
#define HFXO_IEN_DNSERR                         (0x1UL << 29)                           /**< Did Not Start Error Interrupt               */
#define _HFXO_IEN_DNSERR_SHIFT                  29                                      /**< Shift value for HFXO_DNSERR                 */
#define _HFXO_IEN_DNSERR_MASK                   0x20000000UL                            /**< Bit mask for HFXO_DNSERR                    */
#define _HFXO_IEN_DNSERR_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for HFXO_IEN                   */
#define HFXO_IEN_DNSERR_DEFAULT                 (_HFXO_IEN_DNSERR_DEFAULT << 29)        /**< Shifted mode DEFAULT for HFXO_IEN           */
#define HFXO_IEN_LFTIMEOUTERR                   (0x1UL << 30)                           /**< Low Frequency Timeout Error Interrupt       */
#define _HFXO_IEN_LFTIMEOUTERR_SHIFT            30                                      /**< Shift value for HFXO_LFTIMEOUTERR           */
#define _HFXO_IEN_LFTIMEOUTERR_MASK             0x40000000UL                            /**< Bit mask for HFXO_LFTIMEOUTERR              */
#define _HFXO_IEN_LFTIMEOUTERR_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for HFXO_IEN                   */
#define HFXO_IEN_LFTIMEOUTERR_DEFAULT           (_HFXO_IEN_LFTIMEOUTERR_DEFAULT << 30)  /**< Shifted mode DEFAULT for HFXO_IEN           */
#define HFXO_IEN_COREBIASOPTERR                 (0x1UL << 31)                           /**< Core Bias Optimization Error Interrupt      */
#define _HFXO_IEN_COREBIASOPTERR_SHIFT          31                                      /**< Shift value for HFXO_COREBIASOPTERR         */
#define _HFXO_IEN_COREBIASOPTERR_MASK           0x80000000UL                            /**< Bit mask for HFXO_COREBIASOPTERR            */
#define _HFXO_IEN_COREBIASOPTERR_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for HFXO_IEN                   */
#define HFXO_IEN_COREBIASOPTERR_DEFAULT         (_HFXO_IEN_COREBIASOPTERR_DEFAULT << 31) /**< Shifted mode DEFAULT for HFXO_IEN           */

/* Bit fields for HFXO LOCK */
#define _HFXO_LOCK_RESETVALUE                   0x0000580EUL                            /**< Default value for HFXO_LOCK                 */
#define _HFXO_LOCK_MASK                         0x0000FFFFUL                            /**< Mask for HFXO_LOCK                          */
#define _HFXO_LOCK_LOCKKEY_SHIFT                0                                       /**< Shift value for HFXO_LOCKKEY                */
#define _HFXO_LOCK_LOCKKEY_MASK                 0xFFFFUL                                /**< Bit mask for HFXO_LOCKKEY                   */
#define _HFXO_LOCK_LOCKKEY_DEFAULT              0x0000580EUL                            /**< Mode DEFAULT for HFXO_LOCK                  */
#define _HFXO_LOCK_LOCKKEY_UNLOCK               0x0000580EUL                            /**< Mode UNLOCK for HFXO_LOCK                   */
#define HFXO_LOCK_LOCKKEY_DEFAULT               (_HFXO_LOCK_LOCKKEY_DEFAULT << 0)       /**< Shifted mode DEFAULT for HFXO_LOCK          */
#define HFXO_LOCK_LOCKKEY_UNLOCK                (_HFXO_LOCK_LOCKKEY_UNLOCK << 0)        /**< Shifted mode UNLOCK for HFXO_LOCK           */

/** @} End of group EFR32SG23_HFXO_BitFields */
/** @} End of group EFR32SG23_HFXO */
/** @} End of group Parts */

#endif // EFR32SG23_HFXO_H
